Config/Documents/ТабельУчетаПосещаемостиДетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТабельУчетаПосещаемостиДетей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТабельУчетаПосещаемостиДетей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВМесяце</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскаяПлатаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТабеля</Name>
					<Comment>0 - по дням, 1 - сводно</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Невыходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНевыхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричиныНепосещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНевыхода</Name>
							<Comment>0 - оплачиваемый, 1 - неоплачиваемый</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НевыходыСводно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплНевыходы</Name>
							<Comment>Количество оплачиваемых невыходов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеоплНевыходы</Name>
							<Comment>Количество неоплачиваемых невыходов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричиныНепосещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНевыходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СоставГруппДДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставГруппДДУ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоставГруппДДУДополнительныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставГруппДДУДополнительныеУслуги</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиОплатыОбразование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ТабельУчетаПосещаемостиДетей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация, Группа, Дата");  
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Организация", РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("Группа", РеквизитыДокумента.Группа);
	Запрос.УстановитьПараметр("Дата", РеквизитыДокумента.Дата);
	
	Если ДокументСсылка.ВидТабеля = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	&Организация КАК Организация,
		               |	&Группа КАК Группа,
		               |	Док.Ребенок КАК Ребенок,
		               |	Док.ДатаНевыхода КАК ДатаНевыхода,
		               |	1 КАК ФактНевыхода,
		               |	&Дата КАК Период,
		               |	Док.ВидНевыхода,
		               |	Док.Ссылка.РодительскаяПлатаДопУслуги,
		               |	Непосещения.Причина КАК ПричиныНепосещения
		               |ИЗ
		               |	Документ.ТабельУчетаПосещаемостиДетей.Невыходы КАК Док
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Док.Ребенок КАК Ребенок,
		               |			МАКСИМУМ(Док.ПричиныНепосещения) КАК Причина
		               |		ИЗ
		               |			Документ.ТабельУчетаПосещаемостиДетей.Невыходы КАК Док
		               |		ГДЕ
		               |			Док.Ссылка = &Ссылка
		               |			И Док.ПричиныНепосещения <> """"
		               |		СГРУППИРОВАТЬ ПО
		               |			Док.Ребенок) КАК Непосещения
		               |		ПО Док.Ребенок = Непосещения.Ребенок
		               |ГДЕ
		               |	Док.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	&Ссылка КАК Регистратор,
		               |	&Организация КАК Организация,
		               |	&Группа КАК Группа,
		               |	Док.Ребенок КАК Ребенок,
		               |	&Дата КАК Период,
					   |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(Док.Ссылка.КонецПериода, ДЕНЬ), СЕКУНДА, -1) КАК ДатаНевыхода,
		               |	Док.Ссылка.РодительскаяПлатаДопУслуги,
					   |	Док.Ссылка.ВидТабеля КАК ВидТабеля,
		               |	Док.ОплНевыходы КАК ОплСводно,
		               |	Док.НеоплНевыходы КАК НеоплСводно,
		               |	Док.ПричиныНепосещения КАК ПричиныНепосещения
		               |ИЗ
		               |	Документ.ТабельУчетаПосещаемостиДетей.НевыходыСводно КАК Док
		               |ГДЕ
		               |	Док.Ссылка = &Ссылка";
	КонецЕсли;			   
	
	Результат = Запрос.Выполнить().Выгрузить();			   
				   
	ТаблицыДляДвижений.Вставить("ТабельУчетаПосещаемостиДетей", Результат);

КонецПроцедуры

Функция ДниМесяца(ПараметрыДокумента) Экспорт
	ДниМесяца = Новый Структура;
	
	Запрос = Новый Запрос;
	
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПараметрыДокумента.Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПараметрыДокумента.Дата));
	
	Если ТипЗнч(ПараметрыДокумента.ПроизводственныйКалендарь) = Тип("СправочникСсылка.ПроизводственныеКалендари") Тогда
		Запрос.УстановитьПараметр("ПроизводственныйКалендарь",	ПараметрыДокумента.ПроизводственныйКалендарь);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.Дата,
		|	ДанныеПроизводственногоКалендаря.ВидДня
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И ДанныеПроизводственногоКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*)
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь";
	ИначеЕсли ТипЗнч(ПараметрыДокумента.ПроизводственныйКалендарь) = Тип("СправочникСсылка.Календари") Тогда
		Запрос.УстановитьПараметр("ПроизводственныйКалендарь",	ПараметрыДокумента.ПроизводственныйКалендарь.ПроизводственныйКалендарь);
		Запрос.УстановитьПараметр("Календарь", ПараметрыДокумента.ПроизводственныйКалендарь);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	График.ДатаГрафика КАК Дата,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий) КАК ВидДня
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК График
		|ГДЕ
		|	График.Календарь = &Календарь
		|	И График.ДатаГрафика МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И График.ДеньВключенВГрафик
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Календарь.Дата,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье)
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК Календарь
		|ГДЕ
		|	Календарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И Календарь.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ Календарь.Дата В
		|				(ВЫБРАТЬ
		|					График.ДатаГрафика
		|				ИЗ
		|					РегистрСведений.КалендарныеГрафики КАК График
		|				ГДЕ
		|					График.Календарь = &Календарь
		|					И График.ДатаГрафика МЕЖДУ &НачалоМесяца И &КонецМесяца
		|					И График.ДеньВключенВГрафик)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК График
		|ГДЕ
		|	График.Календарь = &Календарь
		|	И График.ДатаГрафика МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И График.ДеньВключенВГрафик
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*)
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК Календарь
		|ГДЕ
		|	Календарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И Календарь.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДниМесяца.Вставить("ДнейВМесяце", Результат[1].Выгрузить()[1].Количество);
	ДниМесяца.Вставить("РабочихДней", Результат[1].Выгрузить()[0].Количество);
	ДниМесяца.Вставить("ВидыДней", Результат[0].Выгрузить());
	
	Возврат ДниМесяца;
КонецФункции

Процедура ОбработатьДубли(ТаблицаДетей, УчитыватьПериод = Ложь)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Таблица.Ребенок КАК Ребенок";
					
	Если УчитыватьПериод Тогда
		Запрос.Текст = Запрос.Текст + ",
						|Таблица.НачалоПериода КАК НачалоПериода,
						|Таблица.ОкончаниеПериода КАК ОкончаниеПериода";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
					|ПОМЕСТИТЬ втДети
					|ИЗ
					|	&Таблица КАК Таблица;
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	втДети.Ребенок";
					
	Если УчитыватьПериод Тогда
		Запрос.Текст = Запрос.Текст + ",
						|втДети.НачалоПериода КАК НачалоПериода,
						|втДети.ОкончаниеПериода КАК ОкончаниеПериода";
	КонецЕсли;					
	
	Запрос.Текст = Запрос.Текст + "
					|ИЗ
					|	втДети
					|УПОРЯДОЧИТЬ ПО
					|	втДети.Ребенок.Наименование;";
	Запрос.УстановитьПараметр("Таблица", ТаблицаДетей);
	
	ТаблицаДетей = Запрос.Выполнить().Выгрузить();
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ТабельУчетаПосещаемостиДетей";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0504608_103н";
	КомандаПечати.Представление		= НСтр("ru = 'Табель учета посещаемости детей (ф. 0504608), ред.103н'");
	КомандаПечати.Порядок			= 1;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ТабельУчетаПосещаемостиДетей";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно";
	КомандаПечати.Представление		= НСтр("ru = 'Табель учета посещаемости детей (сводно)'");
	КомандаПечати.Порядок			= 2;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ТабельУчетаПосещаемостиДетей";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0504608_52н";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Табель учета посещаемости детей (ф. 0504608), ред.52н'");
	КомандаПечати.Порядок			= 97;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ТабельУчетаПосещаемостиДетей";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0504608";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Табель учета посещаемости детей (ф. 0504608)'");
	КомандаПечати.Порядок			= 98;

	
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0504608_103н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_Форма0504608_103н",
		"Табель учета посещаемости детей (ф.0504608), ред.103н",
		ПечатьТабеля(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Форма0504608_103н"));
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0504608_52н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_Форма0504608_52н",
		"Табель учета посещаемости детей (ф.0504608), ред.52н",
		ПечатьТабеля(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Форма0504608_52н"));
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0504608") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_Форма0504608",
		"Табель учета посещаемости детей (ф.0504608)",
		ПечатьТабеля(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Форма0504608"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно",
			"Табель учета посещаемости детей (сводно)",
			ПечатьТабеляСводно(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно"));
	КонецЕсли;
		
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьТабеля(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабДокумент 					= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТабельУчетаПосещаемостиДетей";
	Макет 							= УправлениеПечатью.МакетПечатнойФормы("Документ.ТабельУчетаПосещаемостиДетей." + ИмяМакета);
	
	Если ИмяМакета = "ПФ_MXL_Форма0504608_103н" Тогда
		ПредставлениеНеоплачиваемый = НСтр("ru = 'Нн'");
		ПредставлениеОплачиваемый   = НСтр("ru = 'Но'");
		ПерваяКолонкаДнейПосещения  = 51;
	Иначе
		ПредставлениеНеоплачиваемый = НСтр("ru = 'н'");
		ПредставлениеОплачиваемый   = НСтр("ru = 'н'");
		ПерваяКолонкаДнейПосещения  = 56;
	КонецЕсли;
		
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Ссылка.ВидТабеля = 1 Тогда
			СообщениеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru='Форма 0504608 может использоваться только с табелем, введенным по дням периода! (%1)'"),
											Ссылка);
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю);
			Продолжить;
		КонецЕсли;		
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечати(Ссылка, ПредставлениеНеоплачиваемый, ПредставлениеОплачиваемый);
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(ДанныеДляПечати.ДанныеШапка);
		ТабДокумент.Вывести(Область);
		
		ОбластьЗаголовокЛеваяЧасть	= Макет.ПолучитьОбласть("Заголовок|ЛеваяЧасть");
		ОбластьЗаголовокПраваяЧасть	= Макет.ПолучитьОбласть("Заголовок|ПраваяЧасть");
		
		МассивОбластей = Новый Массив;
		
		Для К = 29 По 31 Цикл
			МассивОбластей.Добавить(Макет.ПолучитьОбласть("Заголовок|Д"+К));
		КонецЦикла;	
		
		ТабДокумент.Вывести(ОбластьЗаголовокЛеваяЧасть);
		
		Для К = 29 По Ссылка.КоличествоДнейВМесяце Цикл
			ТабДокумент.Присоединить(МассивОбластей[К-29]);
		КонецЦикла;
		
		ТабДокумент.Присоединить(ОбластьЗаголовокПраваяЧасть);
		
		ОбластьСтрокаЛеваяЧасть = Макет.ПолучитьОбласть("Строка|ЛеваяЧасть");
		ОбластьСтрокаПраваяЧасть = Макет.ПолучитьОбласть("Строка|ПраваяЧасть");
		
		МассивОбластей.Очистить();
		
		Для К = 29 По 31 Цикл
			МассивОбластей.Добавить(Макет.ПолучитьОбласть("Строка|Д"+К));
		КонецЦикла;
		
		Нпп = 1;
		
		Для Каждого Стр Из ДанныеДляПечати.ДанныеСтрока Цикл
			ОбластьСтрокаЛеваяЧасть.Параметры.Заполнить(Стр);
			ОбластьСтрокаЛеваяЧасть.Параметры.Нпп = Нпп;
			
			Нпп = Нпп + 1;
			
			Если Ссылка.РодительскаяПлатаДопУслуги = 0 Тогда
				Ставки = РегистрыСведений.СоставГруппДДУ.СрезПоследних(НачалоМесяца(Ссылка.НачалоПериода), Новый Структура("Ребенок", Стр.Ребенок));
				
				Если Ставки.Количество() = 0 ИЛИ НЕ Ставки[0].Актуальность Тогда
					Ставки = РегистрыСведений.СоставГруппДДУ.СрезПоследних(КонецМесяца(Ссылка.НачалоПериода), Новый Структура("Ребенок", Стр.Ребенок));
				КонецЕсли;
			Иначе
				Ставки = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(НачалоМесяца(Ссылка.НачалоПериода), Новый Структура("Ребенок, ГруппаДетскогоУчреждения", Стр.Ребенок, Ссылка.Группа));
				
				Если Ставки.Количество() = 0 ИЛИ НЕ Ставки[0].Актуальность Тогда
					Ставки = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(КонецМесяца(Ссылка.НачалоПериода), Новый Структура("Ребенок, ГруппаДетскогоУчреждения", Стр.Ребенок, Ссылка.Группа));
				КонецЕсли;
			КонецЕсли;
			
			Если Ставки.Количество() > 0 Тогда
				Ставка = Ставки[0].СтавкаОплаты;
				Льгота = Ставки[0].Льгота.ПроцентЛьготы;
			Иначе
				Ставка = Справочники.СтавкиОплатыОбразование.ПустаяСсылка();
				Льгота = 0;
			КонецЕсли;
			
			ОбластьСтрокаЛеваяЧасть.Параметры.Ставка = РасчетыПоРодительскойПлате.СтавкаОплаты(НачалоДня(Ссылка.НачалоПериода), 
																								КонецДня(Ссылка.КонецПериода), 
																								Ставка, 
																								Ссылка.КоличествоРабочихДней, 
																								Стр.ДниКОплате,
																								Льгота);
			
			ИнтервалЯчеек = 54;
			К = 0;
			
			ТабДокумент.Вывести(ОбластьСтрокаЛеваяЧасть);
			
			Для К = 29 По Ссылка.КоличествоДнейВМесяце Цикл
				МассивОбластей[К-29].Параметры.Заполнить(Стр);
				
				ТабДокумент.Присоединить(МассивОбластей[К-29]);
			КонецЦикла;
			
			ОбластьСтрокаПраваяЧасть.Параметры.Заполнить(Стр);
			ТабДокумент.Присоединить(ОбластьСтрокаПраваяЧасть);
		КонецЦикла;
		
		ОбластьИтогЛеваяЧасть = Макет.ПолучитьОбласть("Итог|ЛеваяЧасть");
		ОбластьИтогПраваяЧасть = Макет.ПолучитьОбласть("Итог|ПраваяЧасть");
		
		МассивОбластей.Очистить();
		
		Для К = 29 По 31 Цикл
			МассивОбластей.Добавить(Макет.ПолучитьОбласть("Итог|Д"+К));
		КонецЦикла;
		
		ОбластьИтогЛеваяЧасть.Параметры.Заполнить(ДанныеДляПечати.ДанныеИтог[0]);
		ТабДокумент.Вывести(ОбластьИтогЛеваяЧасть);
		
		Для К = 29 По Ссылка.КоличествоДнейВМесяце Цикл
			МассивОбластей[К-29].Параметры.Заполнить(ДанныеДляПечати.ДанныеИтог[0]);
			ТабДокумент.Присоединить(МассивОбластей[К-29]);
		КонецЦикла;
		
		ОбластьИтогПраваяЧасть.Параметры.Заполнить(ДанныеДляПечати.ДанныеИтог[0]);
		ТабДокумент.Присоединить(ОбластьИтогПраваяЧасть);
		
		Область = Макет.ПолучитьОбласть("Подписи");
		Область.Параметры.Заполнить(ДанныеДляПечати.ДанныеПодписи);
		ТабДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПодготовитьДанныеДляПечати(Ссылка, ПредставлениеНеоплачиваемый, ПредставлениеОплачиваемый)
	ДанныеДляПечати = Новый Структура("ДанныеШапка, ДанныеСтрока, ДанныеИтог, ДанныеПодписи");
	
	КалендарныйГрафикГруппы = РасчетыПоРодительскойПлате.ПолучитьКалендарныйГрафикГруппы(Ссылка.Группа, Ссылка.НачалоПериода);
	
	// Шапка
	ДанныеШапка = Новый Структура;
	ДанныеШапка.Вставить("Дата", Ссылка.НачалоПериода);
	ДанныеШапка.Вставить("ДатаДокумента", Ссылка.Дата);
	ДанныеШапка.Вставить("Учреждение", ?(Ссылка.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, Ссылка.Организация.НаименованиеСокращенное,
										 Ссылка.Организация.НаименованиеПолное));
	ДанныеШапка.Вставить("Группа", Ссылка.Группа);
	ДанныеШапка.Вставить("ОКПО", Ссылка.Организация.КодОКПО);
	ДанныеШапка.Вставить("ВидРасчета", "");
	ДанныеШапка.Вставить("РежимРаботы", ?(ЗначениеЗаполнено(КалендарныйГрафикГруппы), КалендарныйГрафикГруппы, ""));
	
	ДанныеДляПечати.ДанныеШапка = ДанныеШапка;
	
	// ТЧ, Итог
	ПараметрыДокумента = Новый Структура("ПроизводственныйКалендарь, Дата", Ссылка.ГрафикРаботы, Ссылка.Дата);
	ДниМесяца = ДниМесяца(ПараметрыДокумента);
	ДнейВМесяце = ДниМесяца.ДнейВМесяце;
	РабочихДней = ДниМесяца.РабочихДней;
	ВидыДней = ДниМесяца.ВидыДней;
	
	ТаблицаТЧ = ЗаполнитьТаблицуПосещений(Ссылка.ПолучитьОбъект());
	ТаблицаТЧ.Колонки.Добавить("ДниКОплате", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ТаблицаТЧ.Колонки.Добавить("ПропущеноВсего", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ТаблицаТЧ.Колонки.Добавить("ПропущеноУчитываемых", ОбщегоНазначения.ОписаниеТипаЧисло(3));
			
	Для К = (Ссылка.КоличествоДнейВМесяце + 1) По 31 Цикл
		ТаблицаТЧ.ЗаполнитьЗначения("х", "День"+К);
	КонецЦикла;
	
	ТаблицаИтог = ПодбитьИтоги(ТаблицаТЧ);
	
	// Подсчет дней по строке и заполнение наименований дней непосещения для устаревших отчетов.
	Для Каждого СтрТЧ Из ТаблицаТЧ Цикл
		ДниКОплате = 0;
		ИтогОпл = 0;
		ИтогНеопл = 0;
		
		Для К = 1 По 31 Цикл
			
			ДниКОплате = ДниКОплате + ?(СтрТЧ["День"+К]="", 1, 0);
			ИтогОпл = ИтогОпл + ?(СтрТЧ["День"+К]="Но", 1, 0);
			ИтогНеопл = ИтогНеопл + ?(СтрТЧ["День"+К]="Нн", 1, 0);
			
			Если СтрТЧ["День"+К] = "Но" Тогда
				СтрТЧ["День"+К] = ПредставлениеОплачиваемый;
			ИначеЕсли СтрТЧ["День"+К] = "Нн" Тогда
				СтрТЧ["День"+К] = ПредставлениеНеоплачиваемый;
			Иначе
				СтрТЧ["День"+К] = НРег(СтрТЧ["День"+К]);
			КонецЕсли;			
			
		КонецЦикла;
		
		СтрТЧ.ДниКОплате = ДниКОплате + ИтогОпл;
		СтрТЧ.ПропущеноВсего = ИтогОпл + ИтогНеопл;
		СтрТЧ.ПропущеноУчитываемых = ИтогОпл;
	КонецЦикла;
	
	ДанныеДляПечати.ДанныеСтрока = ТаблицаТЧ;
	ДанныеДляПечати.ДанныеИтог = ТаблицаИтог;
	
	// Подписи
	ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием(Ссылка.Организация, Ссылка.Дата);
	
	Руководитель = ОтветственныеЛица.Получить("Руководитель");
	
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("Руководитель", КорреспондентыКлиентСервер.ФИО(Руководитель.ОтветственноеЛицоФИО, ИСТИНА));
	ДанныеПодписи.Вставить("ДолжностьРуководителя", Руководитель.ДолжностьСсылка);
	ДанныеПодписи.Вставить("Воспитатель", ?(ЗначениеЗаполнено(Ссылка.Группа.Воспитатель), 
											Корреспонденты.ФИОПоОбъекту(Ссылка.Группа.Воспитатель, ИСТИНА), ""));
	ДанныеПодписи.Вставить("ДатаДокумента", Ссылка.Дата);
	ДанныеПодписи.Вставить("ФИООтвИсполнитель", Корреспонденты.ФИОПоОбъекту(Ссылка.ОтветственныйИсполнитель, ИСТИНА));
	ДанныеПодписи.Вставить("ОтвИсполнительДолжность", ОрганизационнаяСтруктура.ДолжностьСотрудника(Ссылка.ОтветственныйИсполнитель, Ссылка.Дата));
	
	ДанныеДляПечати.ДанныеПодписи = ДанныеПодписи;
	
	Возврат ДанныеДляПечати;
КонецФункции

Функция ПечатьТабеляСводно(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.РазмерСтраницы = "A4";
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТабельУчетаПосещаемостиДетейСводно";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТабельУчетаПосещаемостиДетей."+ИмяМакета);
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблИтог = Макет.ПолучитьОбласть("Итог");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если Ссылка.ВидТабеля <> 1 Тогда
			ТекстСообщения = НСтр("ru='Не верная печатная форма (вариант ""Сводно"") для документа ""%1"" (вид табеля: ""По дням"")!'");
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Ссылка));
			
			Продолжить;
		КонецЕсли;
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиСводно(Ссылка);
		
		ОблЗаголовок.Параметры.Заполнить(ДанныеДляПечати.Заголовок);
		ТабДокумент.Вывести(ОблЗаголовок);
		
		Для Каждого Стр Из ДанныеДляПечати.Строки Цикл
			ОблСтрока.Параметры.Заполнить(Стр);
			ТабДокумент.Вывести(ОблСтрока);
		КонецЦикла;
		
		ОблИтог.Параметры.Заполнить(ДанныеДляПечати.Итог);
		ТабДокумент.Вывести(ОблИтог);
		
		ОблПодвал.Параметры.Заполнить(ДанныеДляПечати.Подвал);
		ТабДокумент.Вывести(ОблПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Ссылка);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПодготовитьДанныеДляПечатиСводно(Ссылка)
	Результат = Новый Структура("Заголовок,Строки,Итог,Подвал");
	
	Организация = Ссылка.Организация;
	
	Заголовок = Новый Структура;
	Заголовок.Вставить("Период", ПредставлениеПериода(НачалоДня(Ссылка.НачалоПериода), КонецДня(Ссылка.КонецПериода)));
	Заголовок.Вставить("Дата", Ссылка.Дата);
	Заголовок.Вставить("ПоОКУД", "");
	Заголовок.Вставить("ПоОКПО", Организация.КодОКПО);
	Заголовок.Вставить("Организация", ?(Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, Организация.НаименованиеСокращенное, Организация.НаименованиеПолное));
	Заголовок.Вставить("Группа", Ссылка.Группа);
	Результат.Заголовок = Заголовок;
	
	Строки = Новый ТаблицаЗначений;
	Строки.Колонки.Добавить("Нпп", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(10, 0));
	Строки.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.ГруппыДетскогоУчреждения"));
	Строки.Колонки.Добавить("Ребенок", Новый ОписаниеТипов("СправочникСсылка.Дети"));
	Строки.Колонки.Добавить("Нн", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(2, 0));
	Строки.Колонки.Добавить("Но", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(2, 0));
	Строки.Колонки.Добавить("ПричиныНепосещения", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(0));
	
	К = 1;
	Для Каждого Стр Из Ссылка.НевыходыСводно Цикл
		Строка = Строки.Добавить();
		Строка.Нпп = К;
		Строка.Группа = Ссылка.Группа;
		Строка.Ребенок = Стр.Ребенок;
		Строка.Нн = Стр.НеоплНевыходы;
		Строка.Но = Стр.ОплНевыходы;
		Строка.ПричиныНепосещения = Стр.ПричиныНепосещения;
		
		К = К + 1;
	КонецЦикла;
	Результат.Строки = Строки;
	
	Результат.Итог = Новый Структура("Нн,Но", Строки.Итог("Нн"), Строки.Итог("Но"));
	
	Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизацииСсылка("Руководитель", Организация, Ссылка.Дата, Неопределено);
	
	Подвал = Новый Структура;
	Подвал.Вставить("Дата", Ссылка.Дата);
	Подвал.Вставить("Руководитель", Корреспонденты.ФИОПоОбъекту(Руководитель, ИСТИНА));
	
	Результат.Подвал = Подвал;
	
	Возврат Результат;	
КонецФункции

Функция ПодбитьИтоги(ТЧ)
	ТабИтоги = СоздатьТаблицу();
	СтрИтог = ТабИтоги.Добавить();
	
	Запрос = Новый Запрос;
	
	Для К = 1 По 31 Цикл
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ
		|	ВТ_День
		|ИЗ
		|	&ТабДень КАК ТабДень;
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	ВТ_День
		|ГДЕ
		|	ПОДСТРОКА(ВТ_День.День" + К + ", 1, 1) = ""Н""
		|";
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ТабДень", ТЧ.Скопировать(, "День"+К));
		СтрИтог["День"+К] = Запрос.Выполнить().Выгрузить()[0].Количество;
	КонецЦикла;
	
	ИтогОпл = 0;
	ИтогНеопл = 0;
	ИтогНеВГруппе = 0;
	ИтогПосещения = 0;
	
	Для Каждого СтрТЧ Из ТЧ Цикл
		Для К = 1 По 31 Цикл
			ИтогОпл = ИтогОпл + ?(СтрТЧ["День"+К]="Но", 1, 0);
			ИтогНеопл = ИтогНеопл + ?(СтрТЧ["День"+К]="Нн", 1, 0);
			ИтогНеВГруппе = ИтогНеВГруппе + ?(СтрТЧ["День"+К]="-", 1, 0);
			ИтогПосещения = ИтогПосещения + ?(СтрТЧ["День"+К]="", 1, 0);
		КонецЦикла;
	КонецЦикла;
	
	СтрИтог.ПропущеноВсего = ИтогОпл + ИтогНеопл;
	СтрИтог.ПропущеноУчитываемых = ИтогОпл;
	СтрИтог.ДниКОплате = ИтогПосещения + ИтогОпл;
	
	Возврат ТабИтоги;
КонецФункции

Функция СоздатьТаблицу()
	Таблица = Новый ТаблицаЗначений;
	
	Для К = 1 По 31 Цикл
		Таблица.Колонки.Добавить("День"+К, ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5,0));
	КонецЦикла;
	
	Таблица.Колонки.Добавить("ПропущеноВсего", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5,0));
	Таблица.Колонки.Добавить("ПропущеноУчитываемых", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5,0));
	Таблица.Колонки.Добавить("ДниКОплате", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5,0));
	
	Возврат Таблица;
КонецФункции

Функция ПолучитьТаблицуНевыходов(Объект) Экспорт
	СтрокаДни = "";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Док.Ребенок,
	|	Док.ДатаНевыхода,
	|	Док.Ребенок.Наименование КАК ИмяРебенка,";
	
	Для К = 1 По 31 Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБОР
		|		КОГДА ДЕНЬ(Док.ДатаНевыхода) = " + К + "
		|			ТОГДА ВЫБОР
		|					КОГДА Док.ВидНевыхода = 0
		|						ТОГДА 1
		|					ИНАЧЕ 2
		|				КОНЕЦ
		|	КОНЕЦ КАК День" + К;
		
		СтрокаДни = СтрокаДни + "День" + К;
		Если К <> 31 Тогда
			ТекстЗапроса = ТекстЗапроса + ",";
			СтрокаДни = СтрокаДни + ",";
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	Документ.ТабельУчетаПосещаемостиДетей.Невыходы КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ИмяРебенка,
	|	Док.ДатаНевыхода";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Свернуть("Ребенок, ИмяРебенка", СтрокаДни);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьТаблицуДнейМесяца(Объект) Экспорт
	
	КалендарныйГрафикГруппы = РасчетыПоРодительскойПлате.ПолучитьКалендарныйГрафикГруппы(Объект.Группа, Объект.НачалоПериода);
	
	Объект.ГрафикРаботы = ?(ЗначениеЗаполнено(КалендарныйГрафикГруппы), КалендарныйГрафикГруппы, КалендарныеГрафики.ОсновнойПроизводственныйКалендарь());
	
	РабочиеДни = Новый Массив;
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	ТаблицаДней = Новый ТаблицаЗначений;
	
	ТекстЗапроса = "ВЫБРАТЬ";
	
	Если ТипЗнч(Объект.ГрафикРаботы) = Тип("СправочникСсылка.ПроизводственныеКалендари") Тогда
		Для К = 1 По 31 Цикл
			ТекстЗапроса = ТекстЗапроса + "
			|	ВЫБОР
			|		КОГДА ДЕНЬ(Календарь.Дата) = " + К + "
			|			ТОГДА ВЫБОР
			|					КОГДА Календарь.ВидДня В (&РабочиеДни)
			|						ТОГДА ВЫРАЗИТЬ("""" КАК СТРОКА(4))
			|					ИНАЧЕ ВЫРАЗИТЬ(""В"" КАК СТРОКА(4))
			|				КОНЕЦ
			|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(4))
			|	КОНЕЦ КАК День" + К;
			
			ТаблицаДней.Колонки.Добавить("День" + К, Новый ОписаниеТипов("Строка"));
			Если К <> 31 Тогда
				ТекстЗапроса = ТекстЗапроса + ",";
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК Календарь
		|ГДЕ
		|	Календарь.Дата МЕЖДУ &Дата1 И &Дата2
		|	И Календарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|	Графики.ДатаГрафика КАК Дата
		|ПОМЕСТИТЬ 
		|	ВТ_ГрафикРаботы
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК Графики
		|ГДЕ
		|	Графики.Календарь = &ГрафикРаботы
		|	И Графики.ДатаГрафика МЕЖДУ &Дата1 И &Дата2
		|	И Графики.ДеньВключенВГрафик;
		|";
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ";
		
		Для К = 1 По 31 Цикл
			ТекстЗапроса = ТекстЗапроса + "
			|	ВЫБОР
			|		КОГДА День(Календарь.Дата) = " + К + "
			|			ТОГДА ВЫБОР
			|					КОГДА Календарь.Дата В (ВЫБРАТЬ Дата ИЗ ВТ_ГрафикРаботы)
			|						ТОГДА ВЫРАЗИТЬ("""" КАК СТРОКА(4))
			|					ИНАЧЕ ВЫРАЗИТЬ(""В"" КАК СТРОКА(4))
			|				КОНЕЦ
			|		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(4))
			|	КОНЕЦ КАК День" + К;
			
			ТаблицаДней.Колонки.Добавить("День" + К, Новый ОписаниеТипов("Строка"));
			Если К <> 31 Тогда
				ТекстЗапроса = ТекстЗапроса + ",";
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК Календарь
		|ГДЕ
		|	Календарь.Дата МЕЖДУ &Дата1 И &Дата2
		|	И Календарь.ПроизводственныйКалендарь = &ПроизводственныйКалендарь";
	КонецЕсли;	
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РабочиеДни", РабочиеДни);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ?(ТипЗнч(Объект.ГрафикРаботы) = Тип("СправочникСсылка.ПроизводственныеКалендари"), Объект.ГрафикРаботы, Объект.ГрафикРаботы.ПроизводственныйКалендарь));
	Запрос.УстановитьПараметр("ГрафикРаботы", Объект.ГрафикРаботы);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ТаблицаДней.Добавить();
	
	Для Каждого Строка Из Результат Цикл
		Для Каждого Колонка Из Результат.Колонки Цикл
			Если Строка[Колонка.Имя] = "В" Тогда
				ТаблицаДней[0][Колонка.Имя] = "В";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаДней;
КонецФункции

Функция ЗаполнитьТаблицуПосещений(Объект) Экспорт
	
	НачалоПериода = НачалоМесяца(Объект.НачалоПериода);
	КонецПериода = КонецМесяца(Объект.КонецПериода);
	
	ТаблицаНевыходов = ПолучитьТаблицуНевыходов(Объект);
	
	ТаблицаДней = ПолучитьТаблицуДнейМесяца(Объект);
	Если Объект.РодительскаяПлатаДопУслуги = 0 Тогда
		ТаблицаДетей = РодительскаяПлата.СписокДетейДляТабеляОсновнаяПрограмма(НачалоПериода, КонецПериода,
																				?(ЗначениеЗаполнено(Объект.Группа), Объект.Группа, Объект.Организация));
	Иначе
		ТаблицаДетей = РодительскаяПлата.СписокДетейДляТабеляДополнительнаяПрограмма(НачалоПериода, КонецПериода,
																				?(ЗначениеЗаполнено(Объект.Группа), Объект.Группа, Объект.Организация));
	КонецЕсли;
	ТаблицаДетей.Индексы.Добавить("Ребенок");
	
	// В документе могут быть записаны дети, которые отчичслены задним числом. 
	// Для того чтобы старый документ содержал полные и корректные данные, добавим такие записи из таблицы невыходов.
	Для Каждого СтрокаТаблицыНевыходов Из ТаблицаНевыходов Цикл
		РебенокНевыход = СтрокаТаблицыНевыходов.Ребенок;
				
		ОтборПоРебенку = Новый Структура();
		ОтборПоРебенку.Вставить("Ребенок",РебенокНевыход);
		Строки = ТаблицаДетей.НайтиСтроки(ОтборПоРебенку);
		Если Строки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаДетей.Добавить();
			НоваяСтрока.Ребенок = РебенокНевыход;
			НоваяСтрока.НачалоПериода = НачалоПериода;
			НоваяСтрока.ОкончаниеПериода = КонецПериода;
		КонецЕсли;
	КонецЦикла;
	
	ОбработатьДубли(ТаблицаДетей, Истина);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДетей.Ребенок,
	|	ТаблицаДетей.НачалоПериода КАК НачалоПериода,
	|	ТаблицаДетей.ОкончаниеПериода КАК ОкончаниеПериода
	|ПОМЕСТИТЬ 
	|	ВТ_ТаблицаДетей
	|ИЗ
	|	&ТаблицаДетей КАК ТаблицаДетей;
	|	
	|ВЫБРАТЬ
	|	ТаблицаДней.*
	|ПОМЕСТИТЬ 
	|	ВТ_ТаблицаДней
	|ИЗ
	|	&ТаблицаДней КАК ТаблицаДней;
	|
	|ВЫБРАТЬ
	|	ТаблицаНевыходов.*
	|ПОМЕСТИТЬ
	|	ВТ_ТаблицаНевыходов
	|ИЗ
	|	&ТаблицаНевыходов КАК ТаблицаНевыходов;";
	
	Если Объект.Невыходы.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДетей.Ребенок.Наименование КАК ИмяРебенка,
		|	ВТ_ТаблицаДетей.Ребенок.Код КАК Счет,
		|	ВТ_ТаблицаДетей.Ребенок,
		|	ВТ_ТаблицаДетей.НачалоПериода КАК НачалоПериода,
		|   ВТ_ТаблицаДетей.ОкончаниеПериода КАК ОкончаниеПериода,
		|	ВТ_ТаблицаДней.*
		|ПОМЕСТИТЬ
		|	ВТ_Месяц
		|ИЗ
		|	ВТ_ТаблицаДетей,
		|	ВТ_ТаблицаДней;
		|
		|ВЫБРАТЬ
		|	ВТ_Месяц.Ребенок,
		|	ВТ_Месяц.НачалоПериода КАК НачалоПериода,
		|	ВТ_Месяц.ОкончаниеПериода КАК ОкончаниеПериода,
		|	ВТ_Месяц.ИмяРебенка,
		|	ВТ_Месяц.Счет,";
		
		Для К = 1 По 31 Цикл
			ТекстЗапроса = ТекстЗапроса + "
			|	ВЫБОР
			|		КОГДА (" + К + " < ДЕНЬ(ВТ_Месяц.НачалоПериода) ИЛИ " + К + " > ДЕНЬ(ВТ_Месяц.ОкончаниеПериода)) 
			|					И (ВЫРАЗИТЬ(ВТ_Месяц.День" + К + " КАК СТРОКА(4)) = """" ИЛИ ВЫРАЗИТЬ(ВТ_Месяц.День" + К + " КАК СТРОКА(4)) <> ""В"") ТОГДА 1
			|		ИНАЧЕ
			|			ВЫБОР
			|				КОГДА ВТ_ТаблицаНевыходов.День" + К + " = 1 ТОГДА 3
			|				КОГДА ВТ_ТаблицаНевыходов.День" + К + " = 2 ТОГДА 4
			|				ИНАЧЕ 
			|					ВЫБОР
			|						КОГДА ВЫРАЗИТЬ(ВТ_Месяц.День" + К + " КАК СТРОКА(4)) = ""-"" ТОГДА 1
			|						КОГДА ВЫРАЗИТЬ(ВТ_Месяц.День" + К + " КАК СТРОКА(4)) = ""В"" ТОГДА 0
			|						ИНАЧЕ 2
			|					КОНЕЦ
			|				КОНЕЦ	
			|	КОНЕЦ КАК День" + К + ",";
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|	ПричиныНепосещений.ПричинаНепосещения КАК ПричиныНепосещения
		|ПОМЕСТИТЬ
		|	ВТ_ТаблицаДляГруппировки
		|ИЗ
		|	ВТ_Месяц
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТ_ТаблицаНевыходов
		|ПО
		|	ВТ_Месяц.Ребенок = ВТ_ТаблицаНевыходов.Ребенок
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	(
		|	ВЫБРАТЬ
		|		Док.Ребенок КАК Ребенок,
		|		Док.ПричиныНепосещения КАК ПричинаНепосещения
		|	ИЗ
		|   	Документ.ТабельУчетаПосещаемостиДетей.Невыходы КАК Док
		|	ГДЕ
		|		Док.Ссылка = &Ссылка
		|		И Док.ПричиныНепосещения <> """"
		|	) КАК ПричиныНепосещений
		|ПО
		|	ВТ_Месяц.Ребенок = ПричиныНепосещений.Ребенок
		|;";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДетей.Ребенок.Наименование КАК ИмяРебенка,
		|	ВТ_ТаблицаДетей.Ребенок.Код КАК Счет,
		|	ВТ_ТаблицаДетей.Ребенок,";
		
		Для К = 1 По 31 Цикл
			ТекстЗапроса = ТекстЗапроса + "
			|	ВЫБОР	
			|		КОГДА (" + К + " < ДЕНЬ(ВТ_ТаблицаДетей.НачалоПериода) ИЛИ " + К + " > ДЕНЬ(ВТ_ТаблицаДетей.ОкончаниеПериода)) 
			|				И ВЫРАЗИТЬ(ВТ_ТаблицаДней.День" + К + " КАК СТРОКА(4)) = """" ТОГДА 1
			|		ИНАЧЕ 
			|			ВЫБОР 
			|				КОГДА ВЫРАЗИТЬ(ВТ_ТаблицаДней.День" + К + " КАК СТРОКА(4)) = ""В"" ТОГДА 0
			|				ИНАЧЕ 2
			|			КОНЕЦ
			|	КОНЕЦ КАК День" + К + ",";
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|	"""" КАК ПричиныНепосещения
		|ПОМЕСТИТЬ
		|	ВТ_ТаблицаДляГруппировки
		|ИЗ
		|	ВТ_ТаблицаДетей,
		|	ВТ_ТаблицаДней
		|	;";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДляГруппировки.ИмяРебенка,
	|	ВТ_ТаблицаДляГруппировки.Счет,
	|	ВТ_ТаблицаДляГруппировки.Ребенок,";
	
	Для К = 1 По 31 Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|	МАКСИМУМ(ВТ_ТаблицаДляГруппировки.День" + К + ") КАК День" + К + ",";
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	МАКСИМУМ(ВТ_ТаблицаДляГруппировки.ПричиныНепосещения) КАК ПричиныНепосещения
	|ПОМЕСТИТЬ ВТ_ЧисловыеПоля
	|ИЗ
	|	ВТ_ТаблицаДляГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДляГруппировки.ИмяРебенка,
	|	ВТ_ТаблицаДляГруппировки.Счет,
	|	ВТ_ТаблицаДляГруппировки.Ребенок
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ЧисловыеПоля.ИмяРебенка КАК ИмяРебенка,
	|	ВТ_ЧисловыеПоля.Счет КАК Счет,
	|	ВТ_ЧисловыеПоля.Ребенок КАК Ребенок,";
	
	Для К = 1 По 31 Цикл
		ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБОР 
		|		КОГДА ВТ_ЧисловыеПоля.День" + К + " = 0 ТОГДА ""В""
		|		КОГДА ВТ_ЧисловыеПоля.День" + К + " = 1 ТОГДА ""-""
		|		КОГДА ВТ_ЧисловыеПоля.День" + К + " = 3 ТОГДА ""Но""
		|		КОГДА ВТ_ЧисловыеПоля.День" + К + " = 4 ТОГДА ""Нн""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК День" + К + ",";
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|	ВТ_ЧисловыеПоля.ПричиныНепосещения КАК ПричиныНепосещения
	|ИЗ
	|	ВТ_ЧисловыеПоля
	|УПОРЯДОЧИТЬ ПО
	|	ИмяРебенка;";
	
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("ТаблицаДней", ТаблицаДней);
	Запрос.УстановитьПараметр("ТаблицаДетей", ТаблицаДетей);
	Запрос.УстановитьПараметр("ТаблицаНевыходов", ТаблицаНевыходов);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
